ssk-to/spresense-arduino-compatible/Arduino15/packages/SPRESENSE/hardware/spresense/1.0.0/boards.txt
menu.Debug=Debug

##############################################################
generic.name=Spresense Reference Board

generic.upload.tool=spresense-tools
generic.upload.speed=115200
generic.upload.resetmethod=ck
generic.upload.maximum_size=434160
generic.upload.maximum_data_size=163840
generic.upload.wait_for_upload_port=true
generic.serial.disableDTR=true
generic.serial.disableRTS=true

generic.bootloader.tool=spresense-tools

generic.build.mcu=spresense
generic.build.f_cpu=156000000L
generic.build.board=spresense_ast
generic.build.core=spresense
generic.build.variant=generic
generic.build.debug=
generic.build.libpath=

generic.menu.Debug.Disabled=Disabled
generic.menu.Debug.Disabled.build.debug=
generic.menu.Debug.Disabled.build.libpath={runtime.tools.spresense-sdk.path}/release

generic.menu.Debug.Enabled=Enabled
generic.menu.Debug.Enabled.build.debug=
generic.menu.Debug.Enabled.build.libpath={runtime.tools.spresense-sdk.path}/debug

